app/views/equipment/show.html.erb

SELECT `armor_skills`.* FROM `armor_skills` WHERE `armor_skills`.`equipment_id` = 90
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 37 LIMIT 1
---
	<b>Armor Skills:</b>
<% @equipment.armor_skill.each do |armor_skill| %>
	<%= armor_skill.skill.name %> <%= armor_skill.value %>,
<% end %>