app/views/armor_skills/index.html.erb


<% @equipment.armor_skill.each do |armor_skill| %>
---
SELECT `armor_skills`.* FROM `armor_skills` WHERE `armor_skills`.`equipment_id` = 89