app/views/sub_skills/_form.html.erb

SELECT `sub_skills`.* FROM `sub_skills`
---
	@none_option = options_for_select([['None', 0]])
	@sub_skill_options = options_from_collection_for_select(SubSkill.all, :id, :name, @sub_skill.skill.try(:id))