app/controllers/armor_sets_controller.rb

SELECT `armor_sets`.* FROM `armor_sets`
---
  def index
    @armor_sets = ArmorSet.all

SELECT `armor_sets`.* FROM `armor_sets` WHERE `armor_sets`.`id` = 11 LIMIT 1
---
  def show
    @armor_set = ArmorSet.find(params[:id])

INSERT INTO `armor_sets` (`created_at`, `name`, `updated_at`) VALUES ('2013-05-28 02:03:35', 'Jaggi', '2013-05-28 02:03:35')
---
  def create
    @armor_set = ArmorSet.new(params[:armor_set])

    respond_to do |format|
      if @armor_set.save