app/controllers/armor_skills_controller.rb

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 89 LIMIT 1
SELECT `armor_skills`.* FROM `armor_skills`
---
  def index
  	if (params[:equipment_id])
	  	@equipment = Equipment.find(params[:equipment_id])
	    @armor_skills = ArmorSkill.all

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 87 LIMIT 1
---
  def new
  	@equipment = Equipment.find(params[:equipment_id])

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 87 LIMIT 1
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 27 LIMIT 1
INSERT INTO `armor_skills` (`created_at`, `equipment_id`, `skill_id`, `updated_at`, `value`) VALUES ('2013-05-28 02:12:47', 87, NULL, '2013-05-28 02:12:47', NULL)
UPDATE `armor_skills` SET `skill_id` = 77, `value` = 3, `updated_at` = '2013-05-30 02:33:45' WHERE `armor_skills`.`id` = 1201
---
  def create
  	@equipment = Equipment.find(params[:equipment_id])
  	@skill = Skill.find(params[:armor_skill][:skill])
  	params[:armor_skill][:skill] = @skill.id;
	@armor_skill = @equipment.armor_skill.create()
	@armor_skill.skill = @skill
	@armor_skill.value = params[:armor_skill][:value]
	@skill.save

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 88 LIMIT 1
SELECT `armor_skills`.* FROM `armor_skills` WHERE `armor_skills`.`id` = 1840 LIMIT 1
DELETE FROM `armor_skills` WHERE `armor_skills`.`id` = 1840
---
  def destroy
  	@equipment = Equipment.find(params[:equipment_id])
    @armor_skill = ArmorSkill.find(params[:id])
    @armor_skill.destroy