app/controllers/builds_controller.rb

INSERT INTO `builds` (`created_at`, `description`, `generated_description`, `name`, `position_0_id`, `position_1_id`, `position_2_id`, `position_3_id`, `position_4_id`, `position_5_id`, `talisman_id`, `updated_at`) VALUES ('2013-05-27 18:00:32', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2013-05-27 18:00:32')
---
	def create
		if params[:equipment_id]
			new_equip = Equipment.find(params[:equipment_id])

			case new_equip.position
			when 0
				@build.position_0 = new_equip
			when 1
				@build.position_1 = new_equip
			when 2
				@build.position_2 = new_equip
			when 3
				@build.position_3 = new_equip
			when 4
				@build.position_4 = new_equip
			when 5
				@build.position_5 = new_equip
			end

			@build.makeGeneratedDescription

			session[:build] = @build
		end

		if params[:commit] == "Save"
			@build.save