app/controllers/builds_controller.rb

	def index
		@builds = Build.all
---
SELECT `builds`.* FROM `builds`

	def create
		require_equipment

		position_1, position_2, position_3, position_4, position_5 = nil, nil, nil, nil, nil

		if (params[:build][:position_1] != '')
			position_1 = Equipment.find(params[:build][:position_1])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`position` IN (2, 3, 4, 5) LIMIT 1


		@preferred_skills.each do |preferred_skill|
			if preferred_skill != ''
				sub_skill = SubSkill.find(preferred_skill)
---
SELECT `sub_skills`.* FROM `sub_skills` WHERE `sub_skills`.`id` = 0 LIMIT 1

  def destroy
    @build = Build.find(params[:id])
    @build.destroy
---
SELECT `builds`.* FROM `builds` WHERE `builds`.`id` = 1 LIMIT 1
DELETE FROM `builds` WHERE `builds`.`id` = 1