app/controllers/equipment_controller.rb

SELECT `equipment`.* FROM `equipment`
---
  def index
    @equipment = Equipment.all

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 90 LIMIT 1
---
  def show
    @equipment = Equipment.find(params[:id])

SELECT `armor_sets`.* FROM `armor_sets` WHERE `armor_sets`.`id` = 12 LIMIT 1
INSERT INTO `equipment` (`armor_set_id`, `blademaster`, `created_at`, `dragon_res`, `fire_res`, `gunner`, `ice_res`, `in_game`, `max_defense`, `name`, `position`, `price`, `rarity`, `slots`, `thunder_res`, `updated_at`, `water_res`) VALUES (12, 1, '2013-05-28 02:26:26', 1, -2, 0, -1, 1, 101, 'Arzuros Helm', 1, NULL, 2, 1, 0, '2013-05-28 02:26:26', 1)
---
  def create
    @set = ArmorSet.find(params[:equipment][:armor_set])
    params[:equipment][:armor_set] = @set
    @equipment = @set.equipment.create(params[:equipment])

SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 82 LIMIT 1
DELETE FROM `equipment` WHERE `equipment`.`id` = 82
---
  def destroy
    @equipment = Equipment.find(params[:id])
    @equipment.destroy