app/controllers/set_editor_controller.rb

	def index
		@skills = Skill.all
---
SELECT `skills`.* FROM `skills`

	def build_set

		equipment_1 = {
			'name' => params[:equip_name_1],
			'position' => 1,
			'slots' => params[:slots_1],
			'armor_set' => @armor_set,
			'fire_res' => params[:fire_res],
			'water_res' => params[:water_res],
			'thunder_res' => params[:thunder_res],
			'ice_res' => params[:ice_res],
			'dragon_res' => params[:dragon_res],
			'max_defense' => params[:max_defense],
			'in_game' => 1,
			'rarity' => params[:rarity],
			'blademaster' => '1',
			'gunner' => '1',
			'price' => params[:price]
		}
		@equip_1 = @armor_set.equipment.create(equipment_1)
---
INSERT INTO `equipment` (`armor_set_id`, `blademaster`, `created_at`, `dragon_res`, `fire_res`, `gunner`, `ice_res`, `in_game`, `max_defense`, `name`, `position`, `price`, `rarity`, `slots`, `thunder_res`, `updated_at`, `water_res`) VALUES (83, 1, '2013-05-30 04:17:29', -1, -6, 1, -1, 1, 116, 'Lagiacrus X Helm', 1, NULL, 8, 1, 4, '2013-05-30 04:17:29', 1)

		@skill_1, @skill_2, @skill_3, @skill_4, @skill_5 = nil, nil, nil, nil, nil

		if (params[:skill_1].to_i !=	 0)
			@skill_1 = Skill.find(params[:skill_1])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 30 LIMIT 1