app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT `skills`.* FROM `skills`

  def show
    @skill = Skill.find(params[:id])
---
SELECT `sub_skills`.* FROM `sub_skills` WHERE `sub_skills`.`skill_id` = 126

  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save
---
INSERT INTO `skills` (`created_at`, `name`, `updated_at`) VALUES ('2013-05-30 04:24:11', 'Torso Up', '2013-05-30 04:24:11')