app/controllers/sub_skills_controller.rb

SELECT `sub_skills`.* FROM `sub_skills`
---
  def index
    @sub_skills = SubSkill.all

SELECT `sub_skills`.* FROM `sub_skills` WHERE `sub_skills`.`id` = 229 LIMIT 1
---
  def show
    @sub_skill = SubSkill.find(params[:id])

SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 126 LIMIT 1
INSERT INTO `sub_skills` (`created_at`, `name`, `parent_sub_skill_id`, `skill_id`, `skill_value`, `updated_at`) VALUES ('2013-05-30 04:24:36', 'Torso Skills x 2', 0, 126, 1, '2013-05-30 04:24:36')
---
  def create
    @skill = Skill.find(params[:sub_skill][:skill])
    params[:sub_skill][:skill] = @skill
    @sub_skill = @skill.sub_skills.create(params[:sub_skill])